04_OpenFoam/_Tut_02/OpenFOAM-14/incompressibleVoF/wave3D/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh

runApplication refineMesh

runApplication decomposePar

runParallel foamRun

runApplication reconstructPar -newTimes

#------------------------------------------------------------------------------
